socket-load-test.yml
# config:
#   target: "http://localhost:3000"
#   phases:
#     - duration: 20
#       arrivalRate: 100
#   engines:
#    socketio-v3: {}
# scenarios:
#   - name: socket load test
#     engine: socketio-v3
#     flow:
#       - response: "products"

config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 25
  socketio:
    transports: ["websocket"]
scenarios:
  - name: "Emit an event"
    engine: socketio
    flow:
      - emit:
          channel: "echo"
          data: "Hello from Artillery"
          response:
            channel: "echoResponse"
            data: "Hello from Artillery"